%تعریف داده ها
% دبی بر حسب متر مکعب بر ثانیه
Q = [0 0.031545 0.050472 0.06309 0.069399 0.075708 0.088326 0.094635]
% فشارها بر حسب kPa
P_suction = [4.481594 1.72369 -2.413166 -6.3431792 -8.5495024 -11.169511 -16.685319 -19.925856]
P_discharge = [367.490708 333.016908 291.648348 254.416644 227.52708 191.674328 105.489828 50.331748]
deltaP = P_discharge - P_suction
% تبدیل کیلوپاسکال به پاسکال
deltaP = deltaP * 1000
% چگالی بر حسب کیلوگرم بر متر مکعب
Density = 997
% شتاب گرانش برحسب متر بر مجذور ثانیه
g = 9.81
% ترم اختلاف ارتفاع
z_suction = 0.3048
z_discharge = 0.9144
z = z_discharge - z_suction
z = 0.6096
% تعریف فرمول هد پمپ (واحد ها SI )
H = (deltaP/(Density*g)) + z
% رسم نمودار هد پمپ بر حسب دبی حجمی (باز هم تاکید میشود که واحد ها SI )
figure
grid on
plot(Q,H)

