% تعریف داده ها با تاکید موکد اینکه واحد ها SI هستد و داده های دیتاست ها هم
% دستی در اکسل SI ش
Q = [0.004233418 0.003800076 0.003283399 0.002716721 0.002950059 0.002583385 0.002116709 0.002150043 0.001650033 0.001250025 0.00083335 0.000450009 0.000033334]   %m^3/s
w = 115.1917306  % از طریق سرعت دوران ثابت 1100 دستی محاسبه شد  %rad/s
T = [2.1 2 1.9 1.7 1.8 1.7 1.5 1.5 1.4 1.2 1.1 1 0.9]   %N.m
% تعریف فرمول توان مکانیکی
P_mech = T .* w
% مرتب سازی فراخوانی دبی مانند قبل
[Q_sorted, idx] = sort(Q)
P_mech_sorted = P_mech(idx)
% رسم نمودار مکانیکی- دبی
plot(Q_sorted,P_mech_sorted)